renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2013(2014-2019) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_rspi_rx.c
* Device(s)    : RX Family
* Tool-Chain   : Renesas RX Standard Toolchain 3.01.00
* OS           : None
* H/W Platform :
* Description  : Functions for using RSPI on RX devices.
************************************************************************************************************************
* History : DD.MM.YYYY Version Description           
*         : 25.10.2013 1.00     First Release
*           01.05.2014 1.20     Added support for RX62N. Minor bug fixes.
*           19.01.2014 1.30     Added support for RX113, RX64M, and RX71M
*                               Fixed bug in R_RSPI_Control(). Now allow ABORT command while locking is enabled.
*           30.09.2016 1.50     Added support for RX130, RX23T, RX24T and RX65N.
*                               Supported big endian.
*                               Added nop() to wait for the write completion.
*           31.03.2017 1.60     Added support for RX24U.
*           31.07.2017 1.70     Supported RX65N-2MB and RX130-512KB.
*                               Fixed to correspond to Renesas coding rule.
*           20.09.2018 1.80     Supported RX66T.
*           20.12.2018 2.00     Added double buffer and dmadtc transfer mode.
*                               Supported RX72T.
*         : 04.04.2019 2.01     Added support for GNUC and ICCRX.
*                               Fixed coding style. 
***********************************************************************************************************************/
/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Defines for RSPI support */
#include "platform.h"
#include "r_rspi_rx_if.h"

#if RSPI_CFG_LONGQ_ENABLE == 1
/* Uses LONGQ driver headef file. */
#include "r_longq_if.h"
#endif /* RSPI_CFG_LONGQ_ENABLE */

#define RSPI_DATA_ALIGN            (0x00000003u)

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
typedef enum
{
  /* Values will be used as bit flags.*/
    RSPI_DO_TX    = 0x1,
    RSPI_DO_RX    = 0x2,
    RSPI_DO_TX_RX = 0x3
} rspi_operation_t;

typedef struct rspi_tcb_s
{
   void     *psrc;
   void     *pdest;
   uint16_t tx_count;
   uint16_t rx_count;
   uint16_t xfr_length;
   uint8_t  bytes_per_transfer;     // Source buffer bytes per transfer: 1, 2, or 4.
   bool     do_rx_now;              // State flag for valid read data available.
   bool     do_tx;                  // State flag for transmit operation.
   rspi_operation_t  transfer_mode; // Transmit only, receive only, or transmit-receive.
   #if RSPI_CFG_MASK_UNUSED_BITS == (1)
   uint32_t unused_bits_mask;       // For masking the unused upper bits of non power-of-2 data.
   #endif
   rspi_str_tranmode_t data_tran_mode; // Data transfer mode
} rspi_tcb_t;

/* Driver internal shadow copy of register settings. */
typedef struct rspi_ctrl_reg_values_s
{
    uint8_t spcr_val;   // RSPI Control Register (SPCR).
    uint8_t sslp_val;   // RSPI Slave Select Polarity Register (SSLP)
    uint8_t sppcr_val;  // RSPI Pin Control Register (SPPCR)
    uint8_t spscr_val;  // RSPI Sequence Control Register (SPSCR)
    uint8_t spbr_val;   // RSPI Bit Rate Register (SPBR).
    uint8_t spdcr_val;  // RSPI Data Control Register (SPDCR)
    uint8_t spckd_val;  // RSPI Clock Delay Register (SPCKD)
    uint8_t sslnd_val;  // RSPI Slave Select Negation Delay Register (SSLND)
    uint8_t spnd_val;   // RSPI Next-Access Delay Register (SPND)
    uint8_t spcr2_val;  // RSPI Control Register 2 (SPCR2)
    uint8_t spdcr2_val; // RSPI Data Control Register 2 (SPDCR2)
} rspi_ctrl_reg_values_t;

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#if RSPI_CFG_USE_CHAN2 == 1
    #define RSPI_NUM_CHANNELS (3)
#elif RSPI_CFG_USE_CHAN1 == 1
    #define RSPI_NUM_CHANNELS (2)
#elif RSPI_CFG_USE_CHAN0 == 1
    #define RSPI_NUM_CHANNELS (1)
#else
    #error "ERROR in r_rspi_rx configuration. Must enable at least 1 channel for use."
#endif

