renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
#define RSPI_POWER_ON (0)
#define RSPI_POWER_OFF (1)

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
#if  RSPI_CFG_LONGQ_ENABLE == 1
static longq_hdl_t       p_rspi_long_que;     // LONGQ handler
#endif  /* RSPI_CFG_LONGQ_ENABLE */

static void r_rspi_get_buffregaddress(uint8_t channel, uint32_t *p_spdr_adr);
static rspi_err_t r_rspi_ch_check(uint8_t channel);

/* Array of channel handles. One for each physical RSPI channel on the device. */
static struct rspi_config_block_s g_rspi_handles[RSPI_NUM_CHANNELS];

/* Used to prevent having duplicate code for each channel. This only works if the channels are identical (just at 
   different locations in memory). This is easy to tell by looking in iodefine.h and seeing if the same structure
   was used for all channels. */
volatile struct st_rspi R_BSP_EVENACCESS_SFR * g_rspi_channels[RSPI_NUM_CHANNELS] =
{
/* Initialize the array for up to 3 channels. Add more as needed. */
#if   RSPI_NUM_CHANNELS == 1
    &RSPI0,
#elif RSPI_NUM_CHANNELS == 2
    &RSPI0, &RSPI1
#elif RSPI_NUM_CHANNELS == 3
    &RSPI0, &RSPI1, &RSPI2
#endif
};

static volatile uint32_t g_rxdata[RSPI_NUM_CHANNELS]; // Space for fast read of RSPI RX data register.

/* Allocate transfer control blocks for all channels. */
static struct rspi_tcb_s g_rspi_tcb[RSPI_NUM_CHANNELS] = {0};
/* Allocate transaction result code storage for all channels. */
static rspi_callback_data_t g_rspi_cb_data[RSPI_NUM_CHANNELS] = {0};

/* Allocate register settings structure for all channels and initialize to defaults. */
static rspi_ctrl_reg_values_t g_ctrl_reg_values[] =
{
    RSPI_SPCR_DEF,      // Control Register (SPCR)
    RSPI_SSLP_DEF,      // Slave Select Polarity Register (SSLP)
    RSPI_SPPCR_DEF,     // Pin Control Register (SPPCR)
    RSPI_SPSCR_DEF,     // Sequence Control Register (SPSCR)
    RSPI_SPBR_DEF,      // Bit Rate Register (SPBR)
    RSPI_SPDCR_DEF,     // Data Control Register (SPDCR)
    RSPI_SPCKD_DEF,     // Clock Delay Register (SPCKD)
    RSPI_SSLND_DEF,     // Slave Select Negation Delay Register (SSLND)
    RSPI_SPND_DEF,      // Next-Access Delay Register (SPND)
    RSPI_SPCR2_DEF,     // Control Register 2 (SPCR2)
    RSPI_SPDCR2_DEF,    // Data Control Register 2 (SPDCR2)
#if   RSPI_NUM_CHANNELS > 1
    RSPI_SPCR_DEF, // Control Register (SPCR)
    RSPI_SSLP_DEF,      // Slave Select Polarity Register (SSLP)
    RSPI_SPPCR_DEF,     // Pin Control Register (SPPCR)
    RSPI_SPSCR_DEF,     // Sequence Control Register (SPSCR)
    RSPI_SPBR_DEF,      // Bit Rate Register (SPBR)
    RSPI_SPDCR_DEF,     // Data Control Register (SPDCR)
    RSPI_SPCKD_DEF,     // Clock Delay Register (SPCKD)
    RSPI_SSLND_DEF,     // Slave Select Negation Delay Register (SSLND)
    RSPI_SPND_DEF,      // Next-Access Delay Register (SPND)
    RSPI_SPCR2_DEF,     // Control Register 2 (SPCR2)
    RSPI_SPDCR2_DEF,    // Data Control Register 2 (SPDCR2)
#endif
#if   RSPI_NUM_CHANNELS >2
    RSPI_SPCR_DEF, // Control Register (SPCR)
    RSPI_SSLP_DEF,      // Slave Select Polarity Register (SSLP)
    RSPI_SPPCR_DEF,     // Pin Control Register (SPPCR)
    RSPI_SPSCR_DEF,     // Sequence Control Register (SPSCR)
    RSPI_SPBR_DEF,      // Bit Rate Register (SPBR)
    RSPI_SPDCR_DEF,     // Data Control Register (SPDCR)
    RSPI_SPCKD_DEF,     // Clock Delay Register (SPCKD)
    RSPI_SSLND_DEF,     // Slave Select Negation Delay Register (SSLND)
    RSPI_SPND_DEF,      // Next-Access Delay Register (SPND)
    RSPI_SPCR2_DEF,     // Control Register 2 (SPCR2)
    RSPI_SPDCR2_DEF,    // Data Control Register 2 (SPDCR2)
#endif
};

#if RSPI_CFG_MASK_UNUSED_BITS == (1)
/* This is a lookup table to hold bit masks for use when the
 * RSPI_CFG_MASK_UNUSED_BITS config option is enabled.
 * The bit-length specifier field in the SPCMD register is
 * used as the index to select the corresponding mask */
static const uint32_t g_unused_bits_masks[16] = {
    0x000FFFFF,     // 0x0 = 20 bits data length
    0x00FFFFFF,     // 0x1 = 24 bits data length
    0xFFFFFFFF,     // 0x2 = 32 bits data length
    0xFFFFFFFF,     // 0x3 = 32 bits data length
    0x000000FF,     // 0x4 = 8 bits data length
    0x000000FF,     // 0x5 = 8 bits data length
    0x000000FF,     // 0x6 = 8 bits data length
    0x000000FF,     // 0x7 = 8 bits data length
    0x000001FF,     // 0x8 = 9 bits data length
    0x000003FF,     // 0x9 = 10 bits data length
    0x000007FF,     // 0xA = 11 bits data length
    0x00000FFF,     // 0xB = 12 bits data length
    0x00001FFF,     // 0xC = 13 bits data length
    0x00003FFF,     // 0xD = 14 bits data length
    0x00007FFF,     // 0xE = 15 bits data length
    0x0000FFFF,     // 0xF = 16 bits data length
};
#endif

/***********************************************************************************************************************
Private function declarations
***********************************************************************************************************************/
/* Common routine used by RSPI API write or read functions. */
static rspi_err_t  rspi_write_read_common(rspi_handle_t handle,
                                          rspi_command_word_t command_word,
                                          void          *psrc,
                                          void          *pdest,
                                          uint16_t      length,
                                          rspi_operation_t   tx_rx_mode);
/* Sets the baud rate registers for a given frequency. */
static uint32_t rspi_baud_set(uint8_t channel, uint32_t baud_target);
/* Determines the primitive data type required for accessing a given RSPI data frame bit length. */
static uint8_t rspi_get_data_type(rspi_command_word_t frame_length_bits);
/* Common RSPI channel power-on utility. */
static void power_on_off (uint8_t channel, uint8_t on_or_off);
/* Set RSPI interrupt priorities. */
static void rspi_ir_priority_set(uint8_t channel, uint8_t rspi_priority);
/* Clear any pending RSPI interrupts. */
static void rspi_interrupts_clear(uint8_t channel);
/* Disable or enable RSPI interrupts. */
static void rspi_interrupts_enable(uint8_t channel, bool enabled);

static void rspi_spei_grp_isr(void *pdata);
/***********************************************************************************************************************
* Function Name: R_RSPI_Open
* Description  : This function applies power to the RSPI channel,
*                initializes the associated registers,
*                applies user-configurable options,
*                and provides the channel handle for use with other API functions.
* Arguments    : chan -
*                   Number of the RSPI channel to be initialized
*                pconfig -
*                   Pointer to RSPI channel configuration data structure.
*                pcallback -
*                   Pointer to function called from interrupt
*                phandle -
*                   Pointer to user-provided storage for a pointer to the handle data structure.
* Return Value : RSPI_SUCCESS-
*                   Successful; channel initialized
*                RSPI_ERR_BAD_CHAN-
*                   Channel number is invalid for part
*                RSPI_ERR_CH_NOT_CLOSED-
*                   Channel currently in operation; Perform R_RSPI_Close() first
*                RSPI_ERR_NULL_PTR-
*                   pconfig pointer or phandle pointer is NULL
*                RSPI_ERR_ARG_RANGE-
*                   An element of the pconfig structure contains an invalid value.
*                RSPI_ERR_LOCK-
*                      The lock could not be acquired. The channel is busy.
***********************************************************************************************************************/
rspi_err_t   R_RSPI_Open(uint8_t                channel,
                         rspi_chnl_settings_t  *pconfig,
                         rspi_command_word_t  spcmd_command_word,
                         void                 (*pcallback)(void *pcbdat),
                         rspi_handle_t         *phandle)
{
    rspi_ctrl_reg_values_t *my_settings = &(g_ctrl_reg_values[channel]);

    #if RSPI_CFG_REQUIRE_LOCK == 1
    bool        lock_result = false;
    #endif

