renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ((NULL == handle) || ((NULL == pcmd_data) && ((void *)FIT_NO_PTR != pcmd_data)))
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    if (!g_rspi_handles[channel].rspi_chnl_opened)
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_CH_NOT_OPENED;
    }
    #endif

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this RSPI channel. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));

    if ((false == lock_result)&&(RSPI_CMD_ABORT != cmd)) // Only abort cmd is allowed while transfer in progress.
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_LOCK; // The control function is currently locked.
    }
    #endif

    switch(cmd)
    {
        case RSPI_CMD_SET_BAUD:
        {
            p_baud_struct = (rspi_cmd_baud_t *)pcmd_data;

            reg_temp = (*g_rspi_channels[channel]).SPCR.BYTE; // Temporarily save state of the SPCR register.

            /* Temporarily disable the RSPI operation. */
            /* SPE and SPTIE should be cleared simultaneously. */
            (*g_rspi_channels[channel]).SPCR.BYTE = (uint8_t)(reg_temp & (~(RSPI_SPCR_SPTIE | RSPI_SPCR_SPE)));
            if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
            {
                R_BSP_NOP();
            }

            /* Update the baud rate. */
            /* Get the register settings for requested baud rate. */
            if (0 == rspi_baud_set(channel, p_baud_struct->bps_target))
            {
                #if RSPI_CFG_REQUIRE_LOCK == 1
                /* Release lock for this channel. */
                R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
                #endif
                  R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
                return RSPI_ERR_ARG_RANGE; // Could not calculate settings for the requested baud rate.
            }

            (*g_rspi_channels[channel]).SPCR.BYTE = reg_temp; // Re-enable the RSPI operation.
            if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
            {
                R_BSP_NOP();
            }
        }
        break;

        case RSPI_CMD_ABORT:
        {
             /* Perform immediate abort of the active RSPI transfer on this channel.
             * Does not close the channel. */
            rspi_interrupts_enable(channel, false); // Disable interrupts in ICU.
            (*g_rspi_channels[channel]).SPCR.BIT.SPE = 0;  // Disable RSPI. Forces soft reset.
            if (0 == (*g_rspi_channels[channel]).SPCR.BIT.SPE)
            {
                R_BSP_NOP();
            }

            /* Transfer aborted. Call the user callback function passing pointer to the result structure. */
            if ((FIT_NO_FUNC != g_rspi_handles[channel].pcallback) && (NULL != g_rspi_handles[channel].pcallback))
            {
                g_rspi_cb_data[channel].handle = &(g_rspi_handles[channel]);
                g_rspi_cb_data[channel].event_code = RSPI_EVT_TRANSFER_ABORTED;
                g_rspi_handles[channel].pcallback((void*)&(g_rspi_cb_data[channel]));
            }

        }
        break;

        case RSPI_CMD_SETREGS:   /* Expert use only! Set all user supported RSPI regs in one operation. */
        {
       /* Overrides driver default settings.
       * Copies user-specified register settings into driver's shadow copy.
       * Settings do not take effect until the channel is closed and then reopened.
       */
            p_setregs_struct = (rspi_cmd_setregs_t *)pcmd_data;
        /* Set RSPI clock delay registers (SPCKD) */
            (*g_rspi_channels[channel]).SPCKD.BYTE = (uint8_t)(p_setregs_struct->spckd_val & RSPI_SPCKD_MASK);
        /* Set RSPI control register 2 (SPCR2) */
            (*g_rspi_channels[channel]).SPCR2.BYTE = (uint8_t)(p_setregs_struct->spcr2_val & RSPI_SPCR2_MASK);
        /* Set RSPI next-access delay register (SPND) */
            (*g_rspi_channels[channel]).SPND.BYTE = (uint8_t)(p_setregs_struct->spnd_val & RSPI_SPND_MASK);
                    /* Set pin control register (SPPCR) */
            (*g_rspi_channels[channel]).SPPCR.BYTE = (uint8_t)(p_setregs_struct->sppcr_val & RSPI_SPPCR_MASK);
        /* Set RSPI slave select negation delay register (SSLND) */
            (*g_rspi_channels[channel]).SSLND.BYTE = (uint8_t)(p_setregs_struct->sslnd_val & RSPI_SSLND_MASK);
        /* Set slave select polarity register (SSLP). */
            (*g_rspi_channels[channel]).SSLP.BYTE = (uint8_t)(p_setregs_struct->sslp_val & RSPI_SSLP_MASK);
        #if defined BSP_MCU_RX65N || defined BSP_MCU_RX66T || defined BSP_MCU_RX72T
            /* Set RSPI data control register 2 (SPDCR2) */
            (*g_rspi_channels[channel]).SPDCR2.BYTE = (uint8_t)(p_setregs_struct->spdcr2_val & RSPI_SPDCR2_MASK);
        #endif
        }
        break;

        case RSPI_CMD_SET_TRANS_MODE:
        {
            p_tran_smode_struct = (rspi_cmd_trans_mode_t*)pcmd_data;
            g_rspi_tcb[channel].data_tran_mode = p_tran_smode_struct->transfer_mode;
        }
        break;

        default:
        {
            #if RSPI_CFG_REQUIRE_LOCK == 1
            /* Release lock for this channel. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
            #endif
            /* Error, command not recognized. */
              R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_UNKNOWN_CMD;
        }
    }

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Release lock for this channel. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
    #endif

    return RSPI_SUCCESS;
}
/* end of function R_RSPI_Control(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_Read
* Description  : Receives data from a SPI device.
* Arguments    : handle-
*                   Handle for the channel
*                spcmd_command_word-
*                   bitfield data consisting of all the RSPI command register settings for SPCMD for this operation.
*                   This value will be placed directly into the SPCMD register by the function. Caller is required to
*                   provide correctly formatted data.
*                pdest-
*                   Pointer to destination buffer into which data will be copied that is received from a SPI .
*                   It is the responsibility of the caller to insure that adequate space is available to hold the
*                   requested data count.
*                length-
*                   Indicates the number of data words to be transferred. The size of the data word is determined from
*                   the channel configuration data structure referenced by the channel handle.
* Return Value : RSPI_SUCCESS-
*                   Read operation successfully completed.
*                RSPI_ERR_CH_NOT_OPENED-
*                   The channel has not been opened.  Perform R_RSPI_Open() first
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*                RSPI_ERR_LOCK-
*                      The lock could not be acquired. The channel is busy.
***********************************************************************************************************************/
rspi_err_t  R_RSPI_Read(rspi_handle_t        handle,
                        rspi_command_word_t  spcmd_command_word,
                        void                *pdest,
                        uint16_t             length)
{
    rspi_err_t  result;

