renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ((NULL == handle) || (NULL == pdest))
    {
          R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    if ((RSPI_TRANS_MODE_DMAC == g_rspi_tcb[handle->channel].data_tran_mode)
      ||(RSPI_TRANS_MODE_DTC == g_rspi_tcb[handle->channel].data_tran_mode))
    {

        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4-byte unit. */
        if (0 != ((uint32_t)pdest & RSPI_DATA_ALIGN))
        {
            R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_INVALID_ARG;
        }

        /* ---- Check the counter (4-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 4 using DMAC or DTC. */
        if (0 != (length & RSPI_DATA_ALIGN))
        {
            R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_INVALID_ARG;
        }
    }

    if (RSPI_BYTE_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, NULL, pdest, length, RSPI_DO_RX);
    }
    else if (RSPI_WORD_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, NULL, pdest, (length >> 1), RSPI_DO_RX);
    }
    else if (RSPI_LONG_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, NULL, pdest, (length >> 2), RSPI_DO_RX);
    }
    else
    {
        return RSPI_ERR_INVALID_ARG;
    }

    return result;
}
/* end of function R_RSPI_Read(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_Write
* Description  : Transmits data to a SPI  device.  The operation differs slightly depending on whether it is using
*                SPI mode or Clock-Synchronous mode.
* Arguments    : handle-
*                   Handle for the channel
*                spcmd_command_word-
*                   Bitfield data consisting of all the RSPI command register settings for SPCMD for this operation.
*                   This value will be placed directly into the SPCMD register by the function. Caller is required to
*                   provide correctly formatted data.
*                psrc-
*                   Pointer to a source data buffer from which data will be transmitted to a SPI device.
*                   The argument must not be NULL.
*                length-
*                   Indicates the number of data words to be transferred. The size of the data word is determined from
*                   the channel configuration data structure referenced by the channel handle.
* Return Value : RSPI_SUCCESS-
*                   Write operation successfully completed.
*                RSPI_ERR_CH_NOT_OPENED-
*                   The channel has not been opened.  Perform R_RSPI_Open() first
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
***********************************************************************************************************************/
rspi_err_t  R_RSPI_Write(rspi_handle_t        handle,
                         rspi_command_word_t  spcmd_command_word,
                         void                *psrc,
                         uint16_t             length)
{
    rspi_err_t  result;

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ((NULL == handle) || (NULL == psrc))
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    if ((RSPI_TRANS_MODE_DMAC == g_rspi_tcb[handle->channel].data_tran_mode)
      ||(RSPI_TRANS_MODE_DTC == g_rspi_tcb[handle->channel].data_tran_mode))
    {
        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4-byte unit. */
        if (0 != ((uint32_t)psrc & RSPI_DATA_ALIGN))
        {
            R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_INVALID_ARG;
        }

        /* ---- Check the counter (4-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 4 using DMAC or DTC. */
        if (0 != (length & RSPI_DATA_ALIGN))
        {
            R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_INVALID_ARG;
        }
    }

    if (RSPI_BYTE_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, psrc, NULL, length, RSPI_DO_TX);
    }
    else if (RSPI_WORD_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, psrc, NULL, (length >> 1), RSPI_DO_TX);
    }
    else if (RSPI_LONG_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, psrc, NULL, (length >> 2), RSPI_DO_TX);
    }
    else
    {
        return RSPI_ERR_INVALID_ARG;
    }

    return result;
}
/* end of function R_RSPI_Write(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_WriteRead
* Description  : Simultaneously transmits data to SPI device while receiving data from SPI device
*                (full duplex).
*                The operation differs slightly depending on whether it is using SPI mode or Clock-Synchronous mode.
* Arguments    : handle-
*                   Handle for the channel
*                spcmd_command_word-
*                   bitfield data consisting of all the RSPI command register settings for SPCMD for this operation.
*                   This value will be placed directly into the SPCMD0 register by the function. Caller is required to
*                   provide correctly formatted data.
*                psrc-
*                   Pointer to a source data buffer from which data will be transmitted to a SPI device.
*                   The argument must not be NULL.
*                pdest-
*                   Pointer to destination buffer into which data will be copied that has been received from SPI slave.
*                   Caller must insure that adequate space is available to hold the requested data count.
*                   Argument must not be NULL.
*                length-
*                   Indicates the number of data words to be transferred. The size of the data word is determined from
*                   the channel configuration data structure referenced by the channel handle.
* Return Value : RSPI_SUCCESS
*                RSPI_ERR_CH_NOT_OPENED-
*                   The channel has not been opened.  Perform R_RSPI_Open() first
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*                RSPI_ERR_LOCK-
*                      The lock could not be acquired. The channel is busy.
***********************************************************************************************************************/
rspi_err_t  R_RSPI_WriteRead(rspi_handle_t        handle,
                             rspi_command_word_t  spcmd_command_word,
                             void                *psrc,
                             void                *pdest,
                             uint16_t             length)
{
    rspi_err_t  result;

