renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if (((NULL == handle) || (NULL == psrc)) || (NULL == pdest))
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    if ((RSPI_TRANS_MODE_DMAC == g_rspi_tcb[handle->channel].data_tran_mode)
      ||(RSPI_TRANS_MODE_DTC == g_rspi_tcb[handle->channel].data_tran_mode))
    {
        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4-byte unit. */
        if ((0 != ((uint32_t)psrc & RSPI_DATA_ALIGN))||(0 != ((uint32_t)pdest & RSPI_DATA_ALIGN)))
        {
            R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_INVALID_ARG;
        }

        /* ---- Check the counter (4-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 4 using DMAC or DTC. */
        if (0 != (length & RSPI_DATA_ALIGN))
        {
            R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
            return RSPI_ERR_INVALID_ARG;
        }
    }

    if (RSPI_BYTE_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, psrc, pdest, length, RSPI_DO_TX_RX);
    }
    else if (RSPI_WORD_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, psrc, pdest, (length >> 1), RSPI_DO_TX_RX);
    }
    else if (RSPI_LONG_DATA == rspi_get_data_type(spcmd_command_word))
    {
        result = rspi_write_read_common(handle, spcmd_command_word, psrc, pdest, (length >> 2), RSPI_DO_TX_RX);
    }
    else
    {
        return RSPI_ERR_INVALID_ARG;
    }

    return result;
}
/* end of function R_RSPI_WriteRead(). */

/***********************************************************************************************************************
* Function Name: rspi_write_read_common
* Description  : Initiates write or read process. Common routine used by RSPI API write or read functions.
* Arguments    : handle-
*                   Handle for the channel
*                command_word-
*                   bitfield data consisting of all the RSPI command register settings for SPCMD for this operation.
*                   This value will be placed directly into the SPCMD0 register by the function. Caller is required to
*                   provide correctly formatted data.
*                psrc-
*                   For write operations, pointer to the source buffer of the data to be sent.
*                pdest-
*                   For read operations, pointer to destination buffer into which receuved data will be copied.
*                length-
*                   The number of data words to be transferred.
* Return Value : RSPI_SUCCESS
*                RSPI_ERR_CH_NOT_OPENED-
*                   The channel has not been opened.  Perform R_RSPI_Open() first
*                RSPI_ERR_LOCK-
*                      The lock could not be acquired. The channel is busy.
***********************************************************************************************************************/
static rspi_err_t  rspi_write_read_common(rspi_handle_t handle,
                                          rspi_command_word_t command_word,
                                          void          *psrc,
                                          void          *pdest,
                                          uint16_t      length,
                                          rspi_operation_t   tx_rx_mode)
{
    uint8_t  channel = handle->channel;

    #if RSPI_CFG_REQUIRE_LOCK == 1
    bool     lock_result = false;
    #endif

    if (!g_rspi_handles[channel].rspi_chnl_opened)
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_CH_NOT_OPENED;
    }

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this RSPI channel. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));

    if (false == lock_result)
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_LOCK; // The control function is currently locked.
    }
    #endif

    rspi_interrupts_enable(channel, false);     // Disable interrupts in ICU.

    g_rspi_tcb[channel].xfr_length = length;
    g_rspi_tcb[channel].tx_count = 0;
    g_rspi_tcb[channel].rx_count = 0;
    g_rspi_tcb[channel].bytes_per_transfer = rspi_get_data_type(command_word);
    g_rspi_tcb[channel].psrc = psrc;
    g_rspi_tcb[channel].pdest = pdest;
    g_rspi_tcb[channel].transfer_mode = tx_rx_mode;

    if (tx_rx_mode & RSPI_DO_TX)
    {
        g_rspi_tcb[channel].do_tx = true;
    }
    else
    {
        g_rspi_tcb[channel].do_tx = false;
    }

    g_rspi_tcb[channel].do_rx_now = false;  // Initialize receive state flag.

    #if RSPI_CFG_MASK_UNUSED_BITS == (1)
    /* Get the data frame bit mask. */
    g_rspi_tcb[channel].unused_bits_mask = g_unused_bits_masks[command_word.bit_length];
    #endif

    /* WAIT_LOOP */
    /* Wait for channel to be idle before making changes to registers. */
    while ((*g_rspi_channels[channel]).SPSR.BIT.IDLNF)
    {
        /* Wait for channel to be idle before making changes to registers. */
    }

    /* Update the SPCMD0 command register with the settings for this transfer. */
#if RSPI_LITTLE_ENDIAN == 1
    (*g_rspi_channels[channel]).SPCMD0.WORD = command_word.word[0];
#else
    (*g_rspi_channels[channel]).SPCMD0.WORD = command_word.word[1];
#endif /* RSPI_LITTLE_ENDIAN == 1 */

    /* If slave mode, force CPHA bit in command register to 1 to properly support 'burst' operation. */
    if (0 == ((*g_rspi_channels[channel]).SPCR.BIT.MSTR))
    {
        (*g_rspi_channels[channel]).SPCMD0.BIT.CPHA = 1;
    }

    /* WAIT_LOOP */
    /* Clear error sources: the SPSR.MODF, OVRF, PERF and UDRF flags. */
    while((*g_rspi_channels[channel]).SPSR.BYTE & (((RSPI_SPSR_OVRF | RSPI_SPSR_MODF) | RSPI_SPSR_PERF) | RSPI_SPSR_UDRF))
    {
        (*g_rspi_channels[channel]).SPSR.BYTE = RSPI_SPSR_MASK;
    }

    (*g_rspi_channels[channel]).SPCR2.BIT.SPIIE = 0; // Disable idle interrrupt.
    if (0 == (*g_rspi_channels[channel]).SPCR2.BIT.SPIIE)
    {
        R_BSP_NOP();
    }

    rspi_interrupts_clear(channel);
    rspi_interrupts_enable(channel, true);           // Enable interrupts in ICU.

    /* Enable transmit buffer empty interrupt, Receive buffer full interrupt,
     * and enable RSPI simultaneously. This will generate an SPTI interrupt,
     * and data transfer will proceed in the ISRs. */
    (*g_rspi_channels[channel]).SPCR.BYTE |= (((RSPI_SPCR_SPTIE | RSPI_SPCR_SPRIE) | RSPI_SPCR_SPEIE) | RSPI_SPCR_SPE);
    if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
    {
        R_BSP_NOP();
    }

    return RSPI_SUCCESS;
}
/* end of function rspi_write_read_common(). */

