renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
/*******************************************************************************
* Function Name: R_RSPI_IntSptiIerClear
* Description  : Clears the ICU.IERm.IENj bit of SPTI to 0.
* Arguments    : handle -
*                    handle for the channel
* Return Value : RSPI_SUCCESS
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*******************************************************************************/
rspi_err_t R_RSPI_IntSptiIerClear(rspi_handle_t handle)
{
    uint8_t channel = handle->channel;

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ( NULL == handle )
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    switch (channel)
    {
        case 0:
#if RSPI_CFG_USE_CHAN0 == 1
            R_BSP_InterruptRequestDisable(VECT(RSPI0,SPTI0));                // Disable RSPI0.SPTI0 interrupt request.
            IR(RSPI0,SPTI0)     = 0;                // Clear RSPI0.SPTI0 interrupt status flag.
            if (0 == IR(RSPI0, SPTI0))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* #if RSPI_CFG_USE_CHAN0 */
        break;

        case 1:
#if RSPI_CFG_USE_CHAN1 == 1
        	R_BSP_InterruptRequestDisable(VECT(RSPI1,SPTI1));                // Disable RSPI1.SPTI1 interrupt request.
            IR(RSPI1,SPTI1)     = 0;                // Clear RSPI1.SPTI1 interrupt status flag.
            if (0 == IR(RSPI1, SPTI1))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* #if RSPI_CFG_USE_CHAN1 */
        break;

        case 2:
#if RSPI_CFG_USE_CHAN2 == 1
        	R_BSP_InterruptRequestDisable(VECT(RSPI2,SPTI2));                // Disable RSPI2.SPTI2 interrupt request.
            IR(RSPI2,SPTI2)     = 0;                // Clear RSPI2.SPTI2 interrupt status flag.
            if (0 == IR(RSPI2, SPTI2))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* #if RSPI_CFG_USE_CHAN2 */
        break;
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    return RSPI_SUCCESS;
}


/*******************************************************************************
* Function Name: R_RSPI_IntSpriIerClear
* Description  : Clears the ICU.IERm.IENj bit of SPRI to 0.
* Arguments    : handle -
*                    handle for the channel
* Return Value : RSPI_SUCCESS
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*******************************************************************************/
rspi_err_t R_RSPI_IntSpriIerClear(rspi_handle_t handle)
{
    uint8_t channel = handle->channel;

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ( NULL == handle )
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    switch (channel)
    {
        case 0:
#if RSPI_CFG_USE_CHAN0 == 1
        	R_BSP_InterruptRequestDisable(VECT(RSPI0,SPRI0));                // Disable RSPI0.SPRI0 interrupt request.
            IR(RSPI0,SPRI0)     = 0;                // Clear RSPI0.SPRI0 interrupt status flag.
            if (0 == IR(RSPI0, SPRI0))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* #if RSPI_CFG_USE_CHAN0 */
        break;

        case 1:
#if RSPI_CFG_USE_CHAN1 == 1
        	R_BSP_InterruptRequestDisable(VECT(RSPI1,SPRI1));                // Disable RSPI1.SPRI1 interrupt request.
            IR(RSPI1,SPRI1)     = 0;                // Clear RSPI1.SPRI1 interrupt status flag.
            if (0 == IR(RSPI1, SPRI1))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* #if RSPI_CFG_USE_CHAN1 */
        break;

        case 2:
#if RSPI_CFG_USE_CHAN2 == 1
        	R_BSP_InterruptRequestDisable(VECT(RSPI2,SPRI2));                // Disable RSPI2.SPRI2 interrupt request.
            IR(RSPI2,SPRI2)     = 0;                // Clear RSPI2.SPRI2 interrupt status flag.
            if (0 == IR(RSPI2, SPRI2))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* #if RSPI_CFG_USE_CHAN2 */
        break;
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    return RSPI_SUCCESS;
}


/*******************************************************************************
* Function Name: R_RSPI_IntSptiDmacdtcFlagSet
* Description  : Sets a DMAC or DTC transfer end flag for SPTI.
* Arguments    : handle -
*                    handle for the channel
* Return Value : RSPI_SUCCESS -
*                    Successful operation
*                RSPI_ERR_INVALID_ARG -
*                    Parameter error
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*******************************************************************************/
rspi_err_t R_RSPI_IntSptiDmacdtcFlagSet(rspi_handle_t handle, rspi_trans_flg_t flg)
{

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ( NULL == handle )
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif


    if ((RSPI_SET_TRANS_STOP != flg) && (RSPI_SET_TRANS_START != flg))
    {
        return RSPI_ERR_INVALID_ARG;
    }

    handle->spti_dmacdtc_flg = flg;

    return RSPI_SUCCESS;
}


/*******************************************************************************
* Function Name: R_RSPI_IntSpriDmacdtcFlagSet
* Description  : Sets DMAC/DTC transfer end flag for SPRI.
* Arguments    : handle -
*                    handle for the channel
* Return Value : RSPI_SUCCESS -
*                    Successful operation
*                RSPI_ERR_INVALID_ARG -
*                    Parameter error
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*******************************************************************************/
rspi_err_t R_RSPI_IntSpriDmacdtcFlagSet(rspi_handle_t handle, rspi_trans_flg_t flg)
{

