renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ( NULL == handle )
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    if ((RSPI_SET_TRANS_STOP != flg) && (RSPI_SET_TRANS_START != flg))
    {
        return RSPI_ERR_INVALID_ARG;
    }

    handle->spri_dmacdtc_flg = flg;

    return RSPI_SUCCESS;
}


/*******************************************************************************
* Function Name: r_rspi_get_buffregaddress
* Description  : Gets address of RSPI data register (SPDR).
* Arguments    : channel -
*                    Which channel to use
*                p_spdr_adr -
*                    Address of RSPI data register (SPDR)
* Return Value : none
*******************************************************************************/
static void r_rspi_get_buffregaddress(uint8_t channel, uint32_t *p_spdr_adr)
{
    *p_spdr_adr = (uint32_t)(&(*g_rspi_channels[channel]).SPDR.LONG);
}

/*******************************************************************************
* Function Name: r_rspi_ch_check
* Description  : Checks whether channel is valid or not.
* Arguments    : channel -
*                    Which channel to use
* Return Value : RSPI_SUCCESS -
*                    The channel is valid.
*                RSPI_ERR_INVALID_ARG -
*                    Parameter error
*******************************************************************************/
static rspi_err_t r_rspi_ch_check(uint8_t channel)
{
    rspi_err_t ret = RSPI_SUCCESS;

    switch (channel)
    {
        case 0:
#if RSPI_CFG_USE_CHAN0 == 1
            /* Do nothing */
#else
            /* RSPI channel 0 is invalid. */
            ret = RSPI_ERR_INVALID_ARG;
#endif
        break;

        case 1:
#if RSPI_CFG_USE_CHAN1 == 1
            /* Do nothing */
#else
            /* RSPI channel 1 is invalid. */
            ret = RSPI_ERR_INVALID_ARG;
#endif
        break;

        case 2:
#if RSPI_CFG_USE_CHAN2 == 1
            /* Do nothing */
#else
            /* RSPI channel 2 is invalid. */
            ret = RSPI_ERR_INVALID_ARG;
#endif
        break;

        default:
            /* The channel number is invalid. */
            ret = RSPI_ERR_INVALID_ARG;
        break;
    }

    return ret;
}


/*******************************************************************************
* Function Name: R_RSPI_GetBuffRegAddress
* Description  : Gets address of RSPI data register (SPDR).
*              : Use the address of RSPI data register to set the transfer source
*              : register or transfer destination register in DMAC or DTC.
* Arguments    : handle -
*                    handle for the channel
*                p_spdr_adr -
*                    Address of RSPI data register (SPDR)
* Return Value : RSPI_SUCCESS -
*                    Successful operation
*                RSPI_ERR_INVALID_ARG -
*                    Parameter error
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*******************************************************************************/
rspi_err_t R_RSPI_GetBuffRegAddress(rspi_handle_t handle, uint32_t *p_spdr_adr)
{
    rspi_err_t ret = RSPI_SUCCESS;
    uint8_t channel = handle->channel;

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ( NULL == handle )
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    /* ---- Check argument. ---- */
    ret = r_rspi_ch_check(channel);
    if (RSPI_SUCCESS != ret)
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_INVALID_ARG;
    }

    if (NULL == p_spdr_adr)
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_INVALID_ARG;
    }

    r_rspi_get_buffregaddress(channel, p_spdr_adr);

    return RSPI_SUCCESS;
}


/***********************************************************************************************************************
* Function Name: R_RSPI_Close
* Description  : Removes power to the RSPI channel designated by the handle and disables the associated interrupts.
* Arguments    : handle-
*                    Handle for the channel
* Return Value : RSPI_SUCCESS-
*                    Successful; channel closed
*                RSPI_ERR_CH_NOT_OPENED-
*                    The channel has not been opened so closing has no effect.
*                RSPI_ERR_NULL_PTR-
*                    A required pointer argument is NULL
***********************************************************************************************************************/
rspi_err_t  R_RSPI_Close(rspi_handle_t handle)
{
    uint8_t channel;

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if (NULL == handle)
    {
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    channel = handle->channel;

    /* Check to see if the channel is currently initialized. */
    if (false == g_rspi_handles[channel].rspi_chnl_opened)
    {
        /* This channel is not open so need not be closed. */
        R_RSPI_LOG_FUNC(RSPI_DEBUG_ERR_ID, (uint32_t)RSPI_STR, __LINE__);
        return RSPI_ERR_CH_NOT_OPENED;
    }

    /* Disable the RSPI operation. */
    /* SPE and SPTIE should be cleared simultaneously. */
    (*g_rspi_channels[channel]).SPCR.BYTE &= (uint8_t)(~(RSPI_SPCR_SPTIE | RSPI_SPCR_SPE));
    if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
    {
        R_BSP_NOP();
    }

    power_on_off(channel, RSPI_POWER_OFF);

    rspi_interrupts_enable(channel, false); // Disable interrupts.

    g_rspi_handles[channel].rspi_chnl_opened = false;

    return RSPI_SUCCESS;
}
/* end of function R_RSPI_Close(). */


/***********************************************************************************************************************
* Function Name: rspi_baud_set
* Description  : Determines the RSPI channel SPBR register setting for the requested baud rate.
*                Returns the actual bit rate that the setting will achieve which may differ from requested.
*                If the requested bit rate cannot be exactly achieved, the next lower bit rate setting will be applied.
*                If successful, applies the calculated setting to the SPBR register.
* Arguments    :
* Return Value :
* Note: Target baud must be >= PCLK/4 to get anything out.
* Limitations   : Does not track dynamically changing PCLK. Relies on constant BSP_PCLKB_HZ
***********************************************************************************************************************/
static uint32_t rspi_baud_set(uint8_t channel, uint32_t bps_target)
{
    uint8_t     spbr_result = 0;
    uint32_t    bps_calc = 0;
    int32_t     f;  // Frequency
    int32_t     n;  // n term in equation
    int32_t     N;  // N term in equation

