renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
    /* Starting with RX63x MCUs and later, there are 2 peripheral clocks: PCLKA and PCLKB.
     * PCLKB matches the functionality of PCLK in RX62x devices as far as the RSPI is concerned. */
    #if defined(BSP_MCU_RX62_ALL)
        f = BSP_PCLK_HZ;
    #elif defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) ||defined (BSP_MCU_RX65N) ||defined (BSP_MCU_RX66T) || defined (BSP_MCU_RX72T)
        f = BSP_PCLKA_HZ;
    #else
        f = BSP_PCLKB_HZ;
    #endif

    /* Get the register settings for requested baud rate. */
    if ((f / bps_target) < 2)
    {
        return 0;   // baud_bps_target too high for the PCLK.
    }
    /*
     * From Hardware manual: Bit rate = f / (2(n + 1)(2^N))
     * where:
     *      f = PCLK, n = SPBR setting, N = BRDV bits
     * Solving for n:
     *      n = (((f/(2^N))/2) / bps) - 1
     *
     */

    /* Only calculate for BRDV value of 0 (div/1) to get SPBR setting for the board PCLK.
     * BRDV setting will be done during write/read operations. */
    N = 0;
    n = ((f >> (N+1)) / (int32_t)bps_target) - 1;  // Solve for SPBR setting.

    if ((n >= 0) && (n <= 0xff))   /* Must be <= SPBR register max value. Must not be negative*/
    {
        /* Now plug n back into the formula for BPS and check it. */
        bps_calc = (uint32_t)(f / (2 *((n + 1) << N)));

        if (bps_calc > bps_target)
        {
            n += 1;
            if (n > 0xff)
            {
                return 0; // result out of range for the PCLK.
            }
        }
        spbr_result = n;

        (*g_rspi_channels[channel]).SPBR = spbr_result;    // Apply the SPBR register value.
        if (0 == (*g_rspi_channels[channel]).SPBR)
        {
            R_BSP_NOP();
        }
        g_ctrl_reg_values[channel].spbr_val = spbr_result; // Update the channel settings record.
    }
    else
    {
        bps_calc = 0;  // result out of range for the PCLK.
    }

    return bps_calc;    // Return the actual BPS rate achieved.
}
/* end of function rspi_baud_set(). */

/***********************************************************************************************************************
* Function Name: rspi_get_data_type
* Description  : Identifies whether the data must be type-cast as 8-bit, 16-bit, or 32-bit for purposes of accessing the
*                source or destination buffers with the right type and index.
* Arguments    : frame_length_bits-
*                   16-bit word containing the bits that define the bits per frame in th SPCMD register.
*                   Only the bits corresponding to "SPB[3:0] RSPI Data Length Setting" of the SPCMDn register are
*                   checked in this argument.
* Return Value : RSPI_BYTE_DATA-
*                   Data is 8-bit.
*                RSPI_WORD_DATA-
*                   Data is > 8-bit and <= 16-bit.
*                RSPI_LONG_DATA-
*                   Data is > 16-bit.
***********************************************************************************************************************/
static uint8_t rspi_get_data_type(rspi_command_word_t command_word)
{
    uint8_t data_type;
    uint8_t frame_length_bits;

#if RSPI_LITTLE_ENDIAN == 1
    frame_length_bits = (uint8_t)((command_word.word[0] & RSPI_SPCMD_SPB) >> 8);
#else
    frame_length_bits = (uint8_t)((command_word.word[1] & RSPI_SPCMD_SPB) >> 8);
#endif /* RSPI_LITTLE_ENDIAN == 1 */

    switch (frame_length_bits)
    {
        case RSPI_SPCMD_BIT_LENGTH_8: // (0x07) 0100 to 0111 = 8 bits data length
        {
            data_type = RSPI_BYTE_DATA;
        }
        break;

        case RSPI_SPCMD_BIT_LENGTH_9:   // (0x08)  1000 = 9 bits data length
        case RSPI_SPCMD_BIT_LENGTH_10:  // (0x09)  1001 = 10 bits data length
        case RSPI_SPCMD_BIT_LENGTH_11:  // (0x0A)  1010 = 11 bits data length
        case RSPI_SPCMD_BIT_LENGTH_12:  // (0x0B)  1011 = 12 bits data length
        case RSPI_SPCMD_BIT_LENGTH_13:  // (0x0C)  1100 = 13 bits data length
        case RSPI_SPCMD_BIT_LENGTH_14:  // (0x0D)  1101 = 14 bits data length
        case RSPI_SPCMD_BIT_LENGTH_15:  // (0x0E)  1110 = 15 bits data length
        case RSPI_SPCMD_BIT_LENGTH_16:  // (0x0F)  1111 = 16 bits data length
        {
            data_type = RSPI_WORD_DATA;
        }
        break;

        case RSPI_SPCMD_BIT_LENGTH_20:  // (0x00)  0000 = 20 bits data length
        case RSPI_SPCMD_BIT_LENGTH_24:  // (0x01)  0001 = 24 bits data length
        case RSPI_SPCMD_BIT_LENGTH_32:  // (0x03)  0011 = 32 bits data length
        case 0x0002:            // Alternate setting for 32 bit.
        {
            data_type = RSPI_LONG_DATA;
        }
        break;

        default:
        {
            data_type = 0;
        }
    }
    return data_type;
}
/* End of function rspi_get_data_access(). */


/***********************************************************************************************************************
* Function Name: power_on_off
* Description : Switches power to an RSPI channel.  Required by FIT spec.
* Arguments : channel -
*                   Which channel to use.
*             on_or_off -
*                   What it says.
* Return Value : none
***********************************************************************************************************************/
static void power_on_off (uint8_t channel, uint8_t on_or_off)
{
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    switch (channel)
    {
        #if RSPI_CFG_USE_CHAN0 == 1
        case 0:
            MSTP(RSPI0) = on_or_off;
            if (0 == MSTP(RSPI0))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CHAN1 == 1
        case 1:
            MSTP(RSPI1) = on_or_off;
            if (0 == MSTP(RSPI1))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CHAN2 == 1
        case 2:
            MSTP(RSPI2) = on_or_off;
            if (0 == MSTP(RSPI2))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        default:
        break;
    }

