renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}
/* End of function power_on(). */


/***********************************************************************************************************************
* Function Name: rspi_ir_priority_set
* Description  : sets the shared interrupt priority level for a channel.
* Arguments : channel -
*                 Which channel to use.
*             rspi_priority-
*                 0-15 priority value. 15 = highest priority.
* Return Value : none
***********************************************************************************************************************/
static void rspi_ir_priority_set(uint8_t channel, uint8_t rspi_priority)
{
    #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N || defined BSP_MCU_RX66T || defined BSP_MCU_RX72T
    bsp_int_ctrl_t int_ctrl_data;
    int_ctrl_data.ipl = (uint32_t)rspi_priority;
    #endif

    switch (channel)
    {
        #if RSPI_CFG_USE_CHAN0 == 1
        case 0:
            IPR(RSPI0, SPRI0) = rspi_priority; // One priority register for all RSPI interrupts (exc RX64M).
             /* RX64M has individual RSPI interrupt priority registers. Set the rest of them */
            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N || defined BSP_MCU_RX66T || defined BSP_MCU_RX72T
            IPR(RSPI0, SPTI0) = rspi_priority;
            /* Enable the group interrupt for the SPEI0 interrupt. (sets priority also). */
            R_BSP_InterruptControl(BSP_INT_SRC_AL0_RSPI0_SPEI0, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);
            #endif

            if (0 == IPR(RSPI0, SPRI0))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CHAN1 == 1
        case 1:
            IPR(RSPI1, SPRI1) = rspi_priority;
            /* RX71M has individual RSPI interrupt priority registers. Set the rest of them */
            #if defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
            IPR(RSPI1, SPTI1) = rspi_priority;
            /* Enable the group interrupt for the SPEI1 interrupt. (sets priority also). */
            R_BSP_InterruptControl(BSP_INT_SRC_AL0_RSPI1_SPEI1, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);
            #endif

            if (0 == IPR(RSPI1, SPRI1))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CHAN2 == 1
        case 2:
            IPR(RSPI2, SPRI2) = rspi_priority;
            #if defined BSP_MCU_RX65N
            IPR(RSPI2, SPTI2) = rspi_priority;
            /* Enable the group interrupt for the SPEI2 interrupt. (sets priority also). */
            R_BSP_InterruptControl(BSP_INT_SRC_AL0_RSPI2_SPEI2, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);
            #endif

            if (0 == IPR(RSPI2, SPRI2))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        default:
        break;
    }
}
/* End of function rspi_ir_priority_set(). */

/***********************************************************************************************************************
* Function Name: rspi_interrupts_clear
* Description  : Clear RSPI interrupts.
* Arguments : channel -
*                 Which channel to use.
* Return Value : none
***********************************************************************************************************************/
static void rspi_interrupts_clear(uint8_t channel)
{
    switch (channel)
    {
        #if RSPI_CFG_USE_CHAN0 == 1
        case 0:
            /* Clear any pending receive buffer full interrupts */
            IR(RSPI0, SPRI0) = 0 ;
            /* Clear any pending transmit buffer empty interrupts */
            IR(RSPI0, SPTI0) = 0 ;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            #ifndef BSP_MCU_RX66T
            #ifndef BSP_MCU_RX72T
            /* Clear any pending error interrupt */
            IR(RSPI0, SPEI0) = 0;
            #endif
            #endif
            #endif
            #endif
            #endif
            #endif

            if (0 == IR(RSPI0, SPTI0))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CHAN1 == 1
        case 1:
            /* Clear any pending receive buffer full interrupts */
            IR(RSPI1, SPRI1) = 0 ;
            /* Clear any pending transmit buffer empty interrupts */
            IR(RSPI1, SPTI1) = 0 ;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            /* Clear any pending error interrupt */
            IR(RSPI1, SPEI1) = 0;
            #endif
            #endif
            #endif
            #endif

            if (0 == IR(RSPI1, SPTI1))
            {
                R_BSP_NOP();
            }
        break;

        #endif

        #if RSPI_CFG_USE_CHAN2 == 1
        case 2:
            IR(RSPI2, SPRI2) = 0 ;
            IR(RSPI2, SPTI2) = 0 ;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX65N
            IR(RSPI2, SPEI2) = 0;
            #endif
            #endif

            if (0 == IR(RSPI2, SPTI2))
            {
                R_BSP_NOP();
            }
        break;
        #endif

        default:
        break;
    }
    #ifdef BSP_MCU_RX63_ALL
        #if RSPI_CFG_USE_RX63_ERROR_INTERRUPT == 1
        IR(ICU, GROUP12) = 0;
        if (0 == IR(ICU, GROUP12))
        {
            R_BSP_NOP();
        }
        #endif
    #endif
}
/* End of function rspi_interrupts_clear(). */

/***********************************************************************************************************************
* Function Name: rspi_interrupts_enable
* Description  : Disable or enable RSPI interrupts.
* Arguments : channel -
*                 Which channel to use.
*             enabled-
*                 true = enable, false = disable.
* Return Value : none
***********************************************************************************************************************/
static void rspi_interrupts_enable(uint8_t channel, bool enabled)
{
    switch (channel)
    {
        #if RSPI_CFG_USE_CHAN0 == 1
        case 0:
            /* Disable or enable receive buffer full interrupt */
            R_BSP_InterruptRequestEnable(VECT(RSPI0,SPRI0));
            /* Disable  or enable transmit buffer empty interrupt */
            R_BSP_InterruptRequestEnable(VECT(RSPI0,SPTI0));
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            #ifndef BSP_MCU_RX66T
            #ifndef BSP_MCU_RX72T
            /* Disable or enable error interrupt */
            R_BSP_InterruptRequestEnable(VECT(RSPI0,SPEI0));
            #endif
            #endif
            #endif
            #endif
            #endif
            #endif

