renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
            if (0 == IEN(RSPI0, SPTI0))
            {
                R_BSP_NOP();
            }
            
            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N || defined BSP_MCU_RX66T || defined BSP_MCU_RX72T
            if (enabled)
            {
                /* Register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI0_SPEI0, (bsp_int_cb_t)rspi_spei_grp_isr);
                /* Enable error interrupt source bit */
                ICU.GENAL0.BIT.EN17 = 1;
                if (0 == ICU.GENAL0.BIT.EN17)
                {
                    R_BSP_NOP();
                }
            }
            else
            {
                /* De-register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI0_SPEI0, FIT_NO_FUNC);
                /* Disable error interrupt source bit */
                ICU.GENAL0.BIT.EN17 = 0;
                if (0 == ICU.GENAL0.BIT.EN17)
                {
                    R_BSP_NOP();
                }
            }
            #endif
        break;
        #endif

        #if RSPI_CFG_USE_CHAN1 == 1
        case 1:
        	R_BSP_InterruptRequestEnable(VECT(RSPI1,SPRI1));
        	R_BSP_InterruptRequestEnable(VECT(RSPI1,SPTI1));
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            /* Disable or enable error interrupt */
            R_BSP_InterruptRequestEnable(VECT(RSPI1,SPEI1));
            #endif
            #endif
            #endif
            #endif

            if (0 == IEN(RSPI1, SPTI1))
            {
                R_BSP_NOP();
            }

            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
            if (enabled)
            {
                /* Register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI1_SPEI1, (bsp_int_cb_t)rspi_spei_grp_isr);
                /* Enable error interrupt source bit */
                ICU.GENAL0.BIT.EN19 = 1;
                if (0 == ICU.GENAL0.BIT.EN19)
                {
                    R_BSP_NOP();
                }
            }
            else
            {
                /* De-register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI1_SPEI1, FIT_NO_FUNC);
                /* Disable error interrupt source bit */
                ICU.GENAL0.BIT.EN19 = 0;
                if (0 == ICU.GENAL0.BIT.EN19)
                {
                    R_BSP_NOP();
                }
            }
            #endif
        break;
        #endif

        #if RSPI_CFG_USE_CHAN2 == 1
        case 2:
        	R_BSP_InterruptRequestEnable(VECT(RSPI2,SPRI2));
        	R_BSP_InterruptRequestEnable(VECT(RSPI2,SPTI2));
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX65N
        	R_BSP_InterruptRequestEnable(VECT(RSPI2,SPEI2));
            #endif
            #endif

            if (0 == IEN(RSPI2, SPTI2))
            {
                R_BSP_NOP();
            }

            #if defined BSP_MCU_RX65N
            if (enabled)
            {
                /* Register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI2_SPEI2, (bsp_int_cb_t)rspi_spei_grp_isr);
                /* Enable error interrupt source bit */
                ICU.GENAL0.BIT.EN21 = 1;
                if (0 == ICU.GENAL0.BIT.EN21)
                {
                    R_BSP_NOP();
                }
            }
            else
            {
                /* De-register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI2_SPEI2, FIT_NO_FUNC);
                /* Disable error interrupt source bit */
                ICU.GENAL0.BIT.EN21 = 0;
                if (0 == ICU.GENAL0.BIT.EN21)
                {
                    R_BSP_NOP();
                }
            }
            #endif
        break;
        #endif

        default:
        break;
    }

    #ifdef BSP_MCU_RX63_ALL
        #if RSPI_CFG_USE_RX63_ERROR_INTERRUPT == 1
        R_BSP_InterruptRequestEnable(VECT(ICU,GROUP12));
        if (0 == IEN(ICU, GROUP12))
        {
            R_BSP_NOP();
        }
        #endif
    #endif

}
/* End of function rspi_interrupts_enable(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_GetVersion
* Description : Returns the version of this module. The version number is
* encoded where the top 2 bytes are the major version number and
* the bottom 2 bytes are the minor version number.
* For example, Rev 4.25 would be 0x00040019.
* NOTE: This function is inlined using #pragma inline directive.
* Arguments : none
* Return Value : Version Number
***********************************************************************************************************************/
uint32_t R_RSPI_GetVersion(void)
{
    uint32_t version_number = 0;
    /* Bring in major version number. */
    version_number = ((uint16_t)RSPI_RX_VERSION_MAJOR) << 16;
    /* Bring in minor version number. */
    version_number |= (uint16_t)RSPI_RX_VERSION_MINOR;
    return version_number;
}

#if RSPI_CFG_LONGQ_ENABLE == 1
/*******************************************************************************
* Function Name: R_RSPI_Set_LogHdlAddress
* Description  : Sets handler address.
* Arguments    : user_long_que -
*                    Handler address
* Return Value : RSPI_SUCCESS -
*                    Successful operation
*******************************************************************************/
rspi_err_t R_RSPI_SetLogHdlAddress(uint32_t user_long_que)
{
    p_rspi_long_que = (longq_hdl_t)user_long_que;
    return RSPI_SUCCESS;
}

