renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
/*******************************************************************************
* Function Name: r_rspi_log
* Description  : Stores error information to LONGQ buffer.
* Arguments    : flg -
*                    Breakpoint processing
*                fid -
*                    RSPI driver file No.
*                line -
*                    RSPI driver line number
* Return Value : 0 -
*                    Successful operation
*                1 -
*                    Error
*******************************************************************************/
uint32_t r_rspi_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err;
    uint32_t    ul_tmp;

    /* Long to Byte */
    ul_tmp = 0;                                         // log     Reserved
    ul_tmp = (ul_tmp | (line << 8));                    // log     LINE
    ul_tmp = (ul_tmp | (fid  << 21));                   // log     FID FILE No.
    ul_tmp = (ul_tmp | (RSPI_DRIVER_ID << 27));         // log     FID DRIVER No.
    ul_tmp = (ul_tmp | (flg  << 31));                   // log     Breakpoint processing

    err = R_LONGQ_Put(p_rspi_long_que, ul_tmp);
    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }
    return 0;
}
#endif

#if RSPI_CFG_LONGQ_ENABLE == 0
/*******************************************************************************
* Function Name: R_RSPI_SetLogHdlAddress
* Description  : Sets handler address.
* Arguments    : user_long_que -
*                    Handler address
* Return Value : RSPI_SUCCESS -
*                    Successful operation
*******************************************************************************/
rspi_err_t R_RSPI_SetLogHdlAddress(uint32_t user_long_que)
{
    return RSPI_SUCCESS;
}
#endif  /* RSPI_CFG_LONGQ_ENABLE */

/******************************************************************************
* Function Name:    rspi_tx_common
* Description  :    common ISR handler for SPTI
* Arguments    :    RSPI channel
* Return Value :    N/A
******************************************************************************/
static void rspi_tx_common(uint8_t channel)
{
    void*       psrc      = g_rspi_tcb[channel].psrc;
    uint16_t    tx_count  = g_rspi_tcb[channel].tx_count;
    uint8_t     data_size = g_rspi_tcb[channel].bytes_per_transfer;

    /* Service the hardware first to keep it busy. */
    /* Feed the TX. */
    if (tx_count < g_rspi_tcb[channel].xfr_length)   // Don't write transmit buffer more than length.
    {
        if (g_rspi_tcb[channel].do_tx)
        {
            /* Transmit the data. TX data register accessed in long words. */
            if (RSPI_BYTE_DATA == data_size)
            {
                (*g_rspi_channels[channel]).SPDR.LONG = ((uint8_t *)psrc)[tx_count];
            }
            else if (RSPI_WORD_DATA == data_size)
            {
                (*g_rspi_channels[channel]).SPDR.LONG = ((uint16_t *)psrc)[tx_count];
            }
            else /* Must be long data. if (RSPI_LONG_DATA == data_size) */
            {
                (*g_rspi_channels[channel]).SPDR.LONG = ((uint32_t *)psrc)[tx_count];
            }
        }
        else /* Must be RX only mode, so transmit dummy data for clocking.*/
        {
            /* TX data register accessed in long words. */
            (*g_rspi_channels[channel]).SPDR.LONG = RSPI_CFG_DUMMY_TXDATA;
        }
        g_rspi_tcb[channel].tx_count++;
    }
    
    else
    {
        /* Last data was transferred. */
        (*g_rspi_channels[channel]).SPCR.BIT.SPTIE = 0;  // Disable SPTI interrupt.
    }
 }

/******************************************************************************
* Function Name:    rspi_rx_common
* Description  :    common ISR handler for  SPRI
* Arguments    :    RSPI channel
* Return Value :    N/A
******************************************************************************/
static void rspi_rx_common(uint8_t channel)
{

    void*       pdest     = g_rspi_tcb[channel].pdest;
    uint16_t    rx_count  = g_rspi_tcb[channel].rx_count;
    uint8_t     data_size = g_rspi_tcb[channel].bytes_per_transfer;
    uint32_t    rx_data   = g_rxdata[channel];

    if (g_rspi_tcb[channel].do_rx_now)
    {
        if (RSPI_BYTE_DATA == data_size)
        {
            ((uint8_t *)pdest)[rx_count-1] = (uint8_t)rx_data;
        }
        else if (RSPI_WORD_DATA == data_size)
        {
            #if RSPI_CFG_MASK_UNUSED_BITS == (1)
            /* Clear unused upper bits of non-standard bit length data transfers. */
            rx_data = (rx_data & g_rspi_tcb[channel].unused_bits_mask);
            #endif
            ((uint16_t *)pdest)[rx_count-1] = (uint16_t)rx_data;
        }
        else  /* Must be long data. if (RSPI_LONG_DATA == data_size) */
        {
            #if RSPI_CFG_MASK_UNUSED_BITS == (1)
            /* Clear unused upper bits of non-standard bit length data transfers. */
            rx_data &= g_rspi_tcb[channel].unused_bits_mask;
            #endif
            ((uint32_t *)pdest)[rx_count-1] = rx_data;
        }
    }

    /* Check for last data.  */
     if (rx_count == g_rspi_tcb[channel].xfr_length)
     {   /* Last data was transferred. */
#if RSPI_CFG_HIGH_SPEED_READ == 1
         (*g_rspi_channels[channel]).SPCR.BIT.SPTIE = 0;  // Disable SPTI interrupt.
#endif
         (*g_rspi_channels[channel]).SPCR.BIT.SPRIE = 0;  // Disable SPRI interrupt.
         (*g_rspi_channels[channel]).SPCR.BIT.SPE   = 0;  // Disable RSPI.
         if (0 == (*g_rspi_channels[channel]).SPCR.BIT.SPE)
         {
             R_BSP_NOP();
         }

         #if RSPI_CFG_REQUIRE_LOCK == 1
         /* Release lock for this channel. */
         R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
         #endif

         /* Transfer complete. Call the user callback function passing pointer to the result structure. */
         if ((FIT_NO_FUNC != g_rspi_handles[channel].pcallback) && (NULL != g_rspi_handles[channel].pcallback))
         {
             g_rspi_cb_data[channel].handle = &(g_rspi_handles[channel]);
             g_rspi_cb_data[channel].event_code = RSPI_EVT_TRANSFER_COMPLETE;
             g_rspi_handles[channel].pcallback((void*)&(g_rspi_cb_data[channel]));
         }
    }
}

