renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
#if RSPI_CFG_USE_CHAN0 == 1
R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spri0_isr, VECT(RSPI0, SPRI0))
/******************************************************************************
* Function Name:    rspi_spri0_isr
* Description  :    RSPI SPRI receive buffer full ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spri0_isr(void)
{
    if (RSPI_TRANS_MODE_SW == g_rspi_tcb[0].data_tran_mode)
    {
        g_rxdata[0] = (*g_rspi_channels[0]).SPDR.LONG; // Need to read RX data reg ASAP.
        g_rspi_tcb[0].rx_count++;
#if RSPI_CFG_HIGH_SPEED_READ == 0
        rspi_tx_common(0);
#endif
        rspi_rx_common(0);
    }
    else
    {
        R_RSPI_IntSpriIerClear(&g_rspi_handles[0]);
        R_RSPI_IntSpriDmacdtcFlagSet(&g_rspi_handles[0], RSPI_SET_TRANS_STOP);
        /* Transfer complete. Call the user callback function passing pointer to the result structure. */
        if ((FIT_NO_FUNC != g_rspi_handles[0].pcallback) && (NULL != g_rspi_handles[0].pcallback))
        {
            g_rspi_cb_data[0].handle = &(g_rspi_handles[0]);
            g_rspi_cb_data[0].event_code = RSPI_EVT_TRANSFER_COMPLETE;
            g_rspi_handles[0].pcallback((void*)&(g_rspi_cb_data[0]));
        }
    }
} /* end rspi_spri0_isr */
#endif

#if RSPI_CFG_USE_CHAN1 == 1
R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spri1_isr, VECT(RSPI1, SPRI1))
/******************************************************************************
* Function Name:    rspi_spri1_isr
* Description  :    RSPI SPRI receive buffer full ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spri1_isr(void)
{
    if (RSPI_TRANS_MODE_SW == g_rspi_tcb[1].data_tran_mode)
    {
        g_rxdata[1] = (*g_rspi_channels[1]).SPDR.LONG; // Need to read RX data reg ASAP.
        g_rspi_tcb[1].rx_count++;
#if RSPI_CFG_HIGH_SPEED_READ == 0
        rspi_tx_common(1);
#endif
        rspi_rx_common(1);
    }
    else
    {
        R_RSPI_IntSpriIerClear(&g_rspi_handles[1]);
        R_RSPI_IntSpriDmacdtcFlagSet(&g_rspi_handles[1], RSPI_SET_TRANS_STOP);
        /* Transfer complete. Call the user callback function passing pointer to the result structure. */
        if ((FIT_NO_FUNC != g_rspi_handles[1].pcallback) && (NULL != g_rspi_handles[1].pcallback))
        {
            g_rspi_cb_data[1].handle = &(g_rspi_handles[1]);
            g_rspi_cb_data[1].event_code = RSPI_EVT_TRANSFER_COMPLETE;
            g_rspi_handles[1].pcallback((void*)&(g_rspi_cb_data[1]));
        }
    }
} /* end rspi_spri1_isr */
#endif

#if RSPI_CFG_USE_CHAN2 == 1
R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spri2_isr, VECT(RSPI2, SPRI2))
/******************************************************************************
* Function Name:    rspi_spri2_isr
* Description  :    RSPI SPRI receive buffer full ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spri2_isr(void)
{
    if (RSPI_TRANS_MODE_SW == g_rspi_tcb[2].data_tran_mode)
    {
        g_rxdata[2] = (*g_rspi_channels[2]).SPDR.LONG; // Need to read RX data reg ASAP.
        g_rspi_tcb[2].rx_count++;
#if RSPI_CFG_HIGH_SPEED_READ == 0
        rspi_tx_common(2);
#endif
        rspi_rx_common(2);
    }
    else
    {
        R_RSPI_IntSpriIerClear(&g_rspi_handles[2]);
        R_RSPI_IntSpriDmacdtcFlagSet(&g_rspi_handles[2], RSPI_SET_TRANS_STOP);
        /* Transfer complete. Call the user callback function passing pointer to the result structure. */
        if ((FIT_NO_FUNC != g_rspi_handles[2].pcallback) && (NULL != g_rspi_handles[2].pcallback))
        {
            g_rspi_cb_data[2].handle = &(g_rspi_handles[2]);
            g_rspi_cb_data[2].event_code = RSPI_EVT_TRANSFER_COMPLETE;
            g_rspi_handles[2].pcallback((void*)&(g_rspi_cb_data[2]));
        }
    }
} /* end rspi_spri2_isr */
#endif
/* end SPRI  */

#if RSPI_CFG_USE_CHAN0 == 1
R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spti0_isr, VECT(RSPI0, SPTI0))
/******************************************************************************
* Function Name:    rspi_spti0_isr
* Description  :    RSPI SPTI transmit buffer empty ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spti0_isr(void)
{
    if (RSPI_TRANS_MODE_SW == g_rspi_tcb[0].data_tran_mode)
    {
        g_rxdata[0] = RSPI0.SPDR.LONG; // Read rx-data register into temp buffer.

            /* If master mode then disable further spti interrupts on first transmit.
            If slave mode then we do two transmits to fill the double buffer,
            then disable spti interrupts.
            The receive interrupt will handle any remaining data. */
#if RSPI_CFG_HIGH_SPEED_READ == 0
            if ((RSPI0.SPCR.BIT.MSTR) || (g_rspi_tcb[0].tx_count > 0))
            {
                RSPI0.SPCR.BIT.SPTIE = 0;  // Disable SPTI interrupt.
                if (0 == RSPI0.SPCR.BIT.SPTIE)
                {
                    R_BSP_NOP();
                }
            }
#endif
        rspi_tx_common(0);

        if (g_rspi_tcb[0].transfer_mode & RSPI_DO_RX)
        {    /* Count was incremented in the call to rspi_tx_rx_common. */
            if ((RSPI0.SPCR.BIT.MSTR) || (g_rspi_tcb[0].tx_count > 1))
            {
                g_rspi_tcb[0].do_rx_now = true; // Enables saving of receive data on next receive interrupt.
            }
        }
    }
    else
    {
        R_RSPI_IntSptiIerClear(&g_rspi_handles[0]);
        R_RSPI_IntSptiDmacdtcFlagSet(&g_rspi_handles[0], RSPI_SET_TRANS_STOP);
    }
} /* end rspi_spti0_isr */
#endif

#if RSPI_CFG_USE_CHAN1 == 1
R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spti1_isr, VECT(RSPI1, SPTI1))
/******************************************************************************
* Function Name:    rspi_spti1_isr
* Description  :    RSPI SPTI transmit buffer empty ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spti1_isr(void)
{
    if (RSPI_TRANS_MODE_SW == g_rspi_tcb[1].data_tran_mode)
    {
        g_rxdata[1] = RSPI1.SPDR.LONG; // Read rx-data register into temp buffer.

            /* If master mode then disable further spti interrupts on first transmit.
            If slave mode then we do two transmits to fill the double buffer,
            then disable spti interrupts.
            The receive interrupt will handle any remaining data. */
#if RSPI_CFG_HIGH_SPEED_READ == 0
            if ((RSPI1.SPCR.BIT.MSTR) || (g_rspi_tcb[1].tx_count > 0))
            {
                RSPI1.SPCR.BIT.SPTIE = 0;  // Disable SPTI interrupt.
                if (0 == RSPI1.SPCR.BIT.SPTIE)
                {
                    R_BSP_NOP();
                }
            }
#endif
        rspi_tx_common(1);

