renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_rspi_rx/src/r_rspi_rx.c
        if (g_rspi_tcb[1].transfer_mode & RSPI_DO_RX)
        {    /* Count was incremented in the call to rspi_tx_rx_common. */
            if ((RSPI1.SPCR.BIT.MSTR) || (g_rspi_tcb[1].tx_count > 1))
            {
                g_rspi_tcb[1].do_rx_now = true; // Enables saving of receive data on next receive interrupt.
            }
        }
    }
    else
    {
        R_RSPI_IntSptiIerClear(&g_rspi_handles[1]);
        R_RSPI_IntSptiDmacdtcFlagSet(&g_rspi_handles[1], RSPI_SET_TRANS_STOP);
    }
} /* end rspi_spti1_isr */
#endif

#if RSPI_CFG_USE_CHAN2 == 1
R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spti2_isr, VECT(RSPI2, SPTI2))
/******************************************************************************
* Function Name:    rspi_spti2_isr
* Description  :    RSPI SPTI transmit buffer empty ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spti2_isr(void)
{
    if (RSPI_TRANS_MODE_SW == g_rspi_tcb[2].data_tran_mode)
    {
        g_rxdata[2] = RSPI2.SPDR.LONG; // Read rx-data register into temp buffer.

            /* If master mode then disable further spti interrupts on first transmit.
            If slave mode then we do two transmits to fill the double buffer,
            then disable spti interrupts.
            The receive interrupt will handle any remaining data. */
#if RSPI_CFG_HIGH_SPEED_READ == 0
            if ((RSPI2.SPCR.BIT.MSTR) || (g_rspi_tcb[2].tx_count > 0))
            {
                RSPI2.SPCR.BIT.SPTIE = 0;  // Disable SPTI interrupt.
                if (0 == RSPI2.SPCR.BIT.SPTIE)
                {
                    R_BSP_NOP();
                }
            }
#endif
        rspi_tx_common(2);

        if (g_rspi_tcb[2].transfer_mode & RSPI_DO_RX)
        {    /* Count was incremented in the call to rspi_tx_rx_common. */
            if ((RSPI2.SPCR.BIT.MSTR) || (g_rspi_tcb[2].tx_count > 1))
            {
                g_rspi_tcb[2].do_rx_now = true; // Enables saving of receive data on next receive interrupt.
            }
        }
    }
    else
    {
        R_RSPI_IntSptiIerClear(&g_rspi_handles[2]);
        R_RSPI_IntSptiDmacdtcFlagSet(&g_rspi_handles[2], RSPI_SET_TRANS_STOP);
    }
} /* end rspi_spti2_isr */
#endif
/* end SPTI  */

/******************************************************************************
* Function Name:    rspi_spei_isr_common
* Description  :    common ISR handler for SPEI RSPI-error
* Arguments    :    RSPI channel
* Return Value :    N/A
******************************************************************************/
static void rspi_spei_isr_common(uint8_t channel)
{
    uint8_t status_flags = (*g_rspi_channels[channel]).SPSR.BYTE;
    rspi_evt_t event = RSPI_EVT_ERR_UNDEF;

    /* Identify and clear error condition. */
    if (status_flags & RSPI_SPSR_OVRF) // Overrun error.
    {
        if (RSPI_EVT_ERR_UNDEF == event)
        {
            event = RSPI_EVT_ERR_READ_OVF;
        }
        /* Clear error source: OVRF flag. */
        (*g_rspi_channels[channel]).SPSR.BIT.OVRF = 0;
    }
    
    if (status_flags & RSPI_SPSR_MODF)
    {
        if (status_flags & RSPI_SPSR_UDRF)
        {
            if (RSPI_EVT_ERR_UNDEF == event)
            {
                event = RSPI_EVT_ERR_UNDER_RUN;
            }
            /* Clear error source: MODF flag and UDRF. */
            (*g_rspi_channels[channel]).SPSR.BYTE &= RSPI_SPSR_MODF_UDRF_MASK;
        }
        else
        {
            if (RSPI_EVT_ERR_UNDEF == event)
            {
                event = RSPI_EVT_ERR_MODE_FAULT;
            }
            /* Clear error source: MODF flag. */
            (*g_rspi_channels[channel]).SPSR.BIT.MODF = 0;
        }
    }
    
    if (status_flags & RSPI_SPSR_PERF)
    {
        if (RSPI_EVT_ERR_UNDEF == event)
        {
            event = RSPI_EVT_ERR_PARITY;
        }
        /* Clear error source: PERF flag. */
        (*g_rspi_channels[channel]).SPSR.BIT.PERF = 0;
    }

    g_rspi_cb_data[channel].event_code = event;

    /* Disable the RSPI operation. */
    (*g_rspi_channels[channel]).SPCR.BYTE &= (uint8_t)(~((RSPI_SPCR_SPTIE | RSPI_SPCR_SPRIE) | RSPI_SPCR_SPE));
    if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
    {
        R_BSP_NOP();
    }

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Release lock for this channel. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
    #endif

    /* Call the user callback function passing pointer to the result structure. */
    if ((FIT_NO_FUNC != g_rspi_handles[channel].pcallback) && (NULL != g_rspi_handles[channel].pcallback))
    {
        g_rspi_cb_data[channel].handle = &(g_rspi_handles[channel]);
        g_rspi_handles[channel].pcallback((void*)&(g_rspi_cb_data[channel]));
    }
} /* end rspi_spei_isr_common() */


/******************************************************************************
* Function Name:    rspi_spei0_isr, rspi_spei1_isr, rspi_spei2_isr
* Description  :    RSPI SPEI RSPI-error ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
#ifndef BSP_MCU_RX63_ALL  /* This interrupt not present in RX63 or RX64M series. */
#ifndef BSP_MCU_RX64M
#ifndef BSP_MCU_RX65N
#ifndef BSP_MCU_RX66T
#ifndef BSP_MCU_RX71M
#ifndef BSP_MCU_RX72T
    #if RSPI_CFG_USE_CHAN0 == 1
    R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spei0_isr, VECT(RSPI0, SPEI0))
    R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spei0_isr(void)
    {
        rspi_spei_isr_common(0);
    } /* end rspi_spei0_isr */
    #endif

    #if RSPI_CFG_USE_CHAN1 == 1
    R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spei1_isr, VECT(RSPI1, SPEI1))
    R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spei1_isr(void)
    {
        rspi_spei_isr_common(1);
    } /* end rspi_spei1_isr */
    #endif

    #if RSPI_CFG_USE_CHAN2 == 1
    R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spei2_isr, VECT(RSPI2, SPEI2))
    R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spei2_isr(void)
    {
        rspi_spei_isr_common(2);
    } /* end rspi_spei2_isr */
    #endif
#endif
#endif
#endif
#endif
#endif
#endif

#ifdef BSP_MCU_RX63_ALL
    #if RSPI_CFG_USE_RX63_ERROR_INTERRUPT == 1
    R_BSP_PRAGMA_STATIC_INTERRUPT(rspi_spei_63_isr, VECT(ICU, GROUP12))
    R_BSP_ATTRIB_STATIC_INTERRUPT void rspi_spei_63_isr(void)
    {
        /* Get the interrupt source from the group interrupt source register. */
        #if RSPI_CFG_USE_CHAN0 == 1
        if (IS(RSPI0, SPEI0))
        {
            rspi_spei_isr_common(0);
        }
        #endif

        #if RSPI_CFG_USE_CHAN1 == 1
        if (IS(RSPI1, SPEI1))
        {
            rspi_spei_isr_common(1);
        }
        #endif

        #if RSPI_CFG_USE_CHAN2 == 1
        if (IS(RSPI2, SPEI2))
        {
            rspi_spei_isr_common(2);
        }
        #endif
    } /* end rspi_spei_63_isr */
    #endif
#endif

/******************************************************************************
* Function Name:    rspi_spei_grp_isr
* Description  :    BSP group interrupt handler for register the error callback function
* Arguments    :    pdata
* Return Value :    N/A
******************************************************************************/
static void rspi_spei_grp_isr(void *pdata)
{
    /* Called from BSP group interrupt handler. */
    #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N || defined BSP_MCU_RX66T || defined BSP_MCU_RX72T
    #if RSPI_CFG_USE_CHAN0 == 1
    if (IS(RSPI0, SPEI0))
    {
        rspi_spei_isr_common(0);
    }
    #endif
    #endif

    #if defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
    #if RSPI_CFG_USE_CHAN1 == 1
    if (IS(RSPI1, SPEI1))
    {
        rspi_spei_isr_common(1);
    }
    #endif
    #endif
    
    #if defined BSP_MCU_RX65N
    #if RSPI_CFG_USE_CHAN2 == 1
    if (IS(RSPI2, SPEI2))
    {
        rspi_spei_isr_common(2);
    }
    #endif
    #endif
}

/* end SPRI  */
